<div style="color:white;
           display:fill;
           border-radius:5px;
           background-color:#5642C5;
           font-size:200%;
           font-family:Arial;letter-spacing:0.5px">

<p width = 20%, style="padding: 10px;
              color:white;">
Pandas: Descriptive statistics and applying functions
</p>
</div>

Data Science Cohort Live NYC Feb 2022
<p>Phase 1: Topic 4</p>
<br>
<br>

<div align = "right">
<img src="Images/flatiron-school-logo.png" align = "right" width="200"/>
</div>

Often want to: 
- Calculate summary statistics for a series and DataFrame.
- Apply a function to a pandas series or DataFrame.

Let's look at the iconic Titanic passenger dataset.

<center>Can data science tell us whether Jack dies? </center>
<div align">
<center><img src="Images/jack_titanic.jpg" width="500"/></center>
</div>

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('Data/titanic.csv', index_col=0)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    object
 4   Age       714 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     204 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.5+ KB

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
# Looks at summary statistics of dataframe
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

#### Calculating Column Statistics


- Particular statistic for many columns
- Calculate statistic for a single column
- DataFrames and Series objects: many built-in methods calculate summary statistics.

In [4]:
df.select_dtypes(
    include=[np.number]).mean()

Survived     0.383838
Pclass       2.308642
Age         29.699118
SibSp        0.523008
Parch        0.381594
Fare        32.204208
dtype: float64

In [5]:
df['Fare'].mean()

32.2042079685746

In [6]:
df['Age'].median()

28.0

In [7]:
df['Age'].quantile(.1)

14.0

#### Other important statistics:

- .mode() -- the mode of the column
- .count() -- the count of the total number of entries in a column
- .std() -- the standard deviation for the column
- .var() -- the variance for the column
- .sum() -- the sum of all values in the column
- .cumsum() -- the cumulative sum, where each cell index contains the sum of all indices lower than, and including, itself.

#### Useful summary methods for categorical columns
- Unique entries in categorical column
- Counts for each unique entry

'Embarked' is a categorical column in our Titanic dataset:

In [8]:
df['Embarked'].head()

PassengerId
1    S
2    C
3    S
4    S
5    S
Name: Embarked, dtype: object

We often want to know the unique values that a categorical can take on:
- Series.unique()

In [9]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

It'd be good to know the breakdown of the counts in each class:
- Series.value_counts()

In [12]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

#### Transforming Series and DataFrames

Sometimes we want to do more than simple pre-defined aggregations. 
Want to implement our own functions on pandas data structures.

- Series.map()
- Series.apply()
- DataFrame.apply()
- DataFrame.applymap()

#### Series.map()
Transform each entry in a Series to entry in new Series using a 1-1 mapping:
- can use dicts
- or define mapping function

Returns a new object.

In [13]:
orig_series = pd.Series([2,5,8], index = ['A', 'B', 'C'])
orig_series

A    2
B    5
C    8
dtype: int64

In [14]:
dict_mapper = {2: 2.5, 5: 7.2, 8: 3.9}
orig_series.map(dict_mapper)

A    2.5
B    7.2
C    3.9
dtype: float64

In [16]:
orig_series

A    2
B    5
C    8
dtype: int64

In [18]:
def func(x):
    return 2*x
orig_series.map(func)

A     4
B    10
C    16
dtype: int64

#### Series.apply():

Applies function elementwise to Series:

- Only applies functions.
- Can do what map does w/ functions but can also do more.
- Can use functions that return Series or DataFrames

In [19]:
orig_series

A    2
B    5
C    8
dtype: int64

In [20]:
# did this with map. map is faster for this.
orig_series.apply(func)

A     4
B    10
C    16
dtype: int64

Series.apply() really shines when you want to do something a little more complicated:

- For each element, compute powers of element up to some order

In [21]:
# this returns a series [x, x**2, x**3,...up to highest order]
def new_func(x, highest_order = 5):
    
    polynomial_series = pd.Series({'Order ' + str(n+1): x**(n+1) for n in range(highest_order)})
    
    return polynomial_series

In [22]:
orig_series

A    2
B    5
C    8
dtype: int64

In [23]:
# pandas will combine series calculated 
# from each element into a dataframe
orig_series.apply(new_func)

   Order 1  Order 2  Order 3  Order 4  Order 5
A        2        4        8       16       32
B        5       25      125      625     3125
C        8       64      512     4096    32768

#### DataFrame.applymap()
- The .applymap() is to DataFrames as .map() is to Series:
    - Applies a 1:1 mapping to each element of a DataFrame
    
Convert every element in numeric dataframe into string:

In [24]:
df_sub = df[['Age', 'Fare']]
df_sub.info()
df_sub

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     714 non-null    float64
 1   Fare    891 non-null    float64
dtypes: float64(2)
memory usage: 20.9 KB

              Age     Fare
PassengerId
1            22.0   7.2500
2            38.0  71.2833
3            26.0   7.9250
4            35.0  53.1000
5            35.0   8.0500
...           ...      ...
887          27.0  13.0000
888          19.0  30.0000
889           NaN  23.4500
890          26.0  30.0000
891          32.0   7.7500

[891 rows x 2 columns]

In [25]:
string_df = df_sub.applymap(lambda x: str(x))
string_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 1 to 891
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     891 non-null    object
 1   Fare    891 non-null    object
dtypes: object(2)
memory usage: 20.9+ KB

#### DataFrame.apply()

- Takes in entire columns (or rows) of dataframe into function and applies transformations:
    - Transformations can be applied column-wise or row-wise.
    - Can return a number, a Series, or a Dataframe.
    
Pretty useful and capable of complex transformations. Let's see an example:

Get the sum of the squares for Age and Fares respectively. Log transform both results.

In [25]:
def log_sq_trans(x):
    x_sq = x**2
    summed_sq = np.sum(x_sq)
    logsquaredsum = np.log(1 + summed_sq)
    
    return logsquaredsum
    
# axis = 0: applies function to each column 
df[['Age', 'Fare']].apply(log_sq_trans, axis = 0)

Age     13.567347
Fare    14.953941
dtype: float64

This, on the other hand, adds the squares of Age and Fare for each row and log transforms the result.

In [26]:
df[['Age', 'Fare']].apply(log_sq_trans, axis = 1)

PassengerId
1      6.287045
2      8.783597
3      6.606387
4      8.305388
5      7.163019
         ...
887    6.801283
888    7.140453
889    6.311558
890    7.363280
891    6.989393
Length: 891, dtype: float64